{
	"posts": [
		{
			"id": "1",
			"title": "Hebrews 1",
			"url": "https://www.youtube.com/watch?v=Jkqo73EygmI",
			"content": "The author is unknown and could possibly be Paul, Barnabas, Apollos, Aquila or Priscilla. The audience is a Jewish audience hence the name Hebrews. Jews spoke Hebrew. The audience are new Christian converts who were Jewish and who had a very strong knowledge of the Torah (Old Testament). The author of Hebrews is surgical in his approach to taking what the audience knew, to explain to them what they needed to know. The Old Testament was the shadow that pointed to Christ. We see in every chapter the author takes the time to show the superiority of Christ over every single established symbol of the Old Testament. We will explore these themes in detail. In this chapter, what we see is the superiority of Jesus over Angels. Enjoy."
		},
		{
			"id": "2",
			"title": "Hebrews 2",
			"url": "https://www.youtube.com/watch?v=DaTNswJD2Ts",
			"content": "In Hebrews 2, we see the author continue to make the case for the superiority of Jesus over the work of angels. We see that the text is broken down into various parts, each one adding to the overall case for Jesus's superior work. The scriptures referenced in this video are Gen 3:15b, Gen 15, John 1:29. Acts 7:35,38,53, Gal 3:19, Rev 5."
		},
		{
			"id": "3",
			"title": "Hebrews 3",
			"url": "https://www.youtube.com/watch?v=F1xFa6hV-Oc",
			"content": "In this chapter, We see the author deal with the superiority of Jesus over Moses. In keeping with the themes from prior verses, the author is taking what the audience is familiar with, and using that to point towards Jesus who is lord over all. Verse 1 tells us that the audience is believers. The theme of this chapter is addressing unbelief."
		},
		{
			"id": "4",
			"title": "Hebrews 4",
			"url": "https://www.youtube.com/watch?v=B1jNI-Lej-w",
			"content": "We see that unbelief is a major theme that the author spends time to address. The author is discussing the rest of God in light of works/effort, and belief. Key scriptures used are 1 John 2:1-2, John 1:1-3, John 1_29, John 1:45, John 2:13-19, John 3:1-16, Gen 3:15, Gen 3:22-23, Heb 2:14-17"
		},
		{
			"id": "5",
			"title": "Hebrews 5",
			"url": "https://www.youtube.com/watch?v=EzcR9LVmzm8",
			"content": "In Hebrews 5, we see how Jesus is the qualified high priest. We are also introduced to a concept of him being a high-priest in the order of Melchizedek. The main ideas of the concept of high-priest is first introduced to us in this chapter."
		}
	]
}